ANGELSWING/app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
	def logged_in_user
		if decoded_token
		  id = decoded_token[0]['user_id']
		  @user = User.find_by(id: id)