ANGELSWING/app/controllers/users_controller.rb

  def signup
	begin
    	@user = User.create(user_params)
---
INSERT INTO `users` (`first_name`, `last_name`, `email`, `password_digest`, `country`, `created_at`, `updated_at`) VALUES ('길', '민호', 'minho95@naver.com', '$2a$12$VkZipl030K6nAZ2shnwD..cV4fzco6ixJQpcTFAFpETt0MrqDFTma', 'anyang', '2022-05-21 05:40:27.734983', '2022-05-21 05:40:27.734983')

  def signin
	begin
		params = login_params()
	rescue ActionController::ParameterMissing => e # parameter missing
		head 400
	else
		auth = params[:auth]
		@user = User.find_by(email: auth[:email]) # email, unique: true
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'rlfalsgh95@naver.com' LIMIT 1